#!/bin/sh

if [ $# -ne 1 ]; then
  say "人数が指定してされていません。もう一度はじめてください" 
  exit 1
fi

sleep 1
say "それでは、$1人でアバロンを開始します。"
sleep 1
say "それでは、アバロンを開始します。全員目を閉じて手を前に出してください。"
sleep 1
say "モードレットの手下とモードレットは目を開けてお互い顔を確認してください。ただしオベロンは目を開けないでください"
sleep 4
say "モードレットの手下は、目を閉じてください"
sleep 1
say "モードレット以外のモードレットの手下は親指を立ててください。"
sleep 1
say "マーリンは目を開けてモードレットの手下を確認してください。"
sleep 4
say "マーリンは目を閉じてモードレットの手下は親指を下げてください"
sleep 1
say "マーリンは親指を上げてください"
sleep 1
say "パーシバルは目を開けてマーリンを確認してください"
sleep 3
say "パーシバルは目を閉じてください"
sleep 1
say "それではゲームスタートです。"
